Enums/ЛБ_УстановкаЗначенияИлиОтклонения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_УстановкаЗначенияИлиОтклонения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Значение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ОтклонениеОтБазовойЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ОтклонениеОтБазовойЦены</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Относительное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Абсолютное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЛБ_ЗаполнениеЦенМеталловАкцияИзПриказа/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Документ") Тогда
		Приказ = Параметры.Документ.Ссылка;  
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Приказ) Тогда 
		Сообщить("Не выбран приказ!");
		Возврат;
	КонецЕсли;   
	
	Если Параметры.ТолькоПросмотр = Истина Тогда
		Элементы.СохранитьИзменения.Доступность = ложь; 
		Элементы.ТаблицаМ.ТолькоПросмотр = Истина;  
	КонецЕсли;		
	ПоГруппамПроб = Истина; 
	
	ТаблицаМеталлов.Загрузить(Приказ.УсловияАкцииМеталлы.Выгрузить());
	
	КатегорииДоп = ТаблицаМеталлов.Выгрузить(, "Категория");
	КатегорииДоп.Свернуть("Категория");   
	
	КлючСтроки = 0; 
	Категории.Очистить();
	Для каждого СтрД Из КатегорииДоп Цикл 
		КлючСтроки = КлючСтроки + 1;
		НоваяСтрД = Категории.Добавить(); 
		НоваяСтрД.КлючСтроки = КлючСтроки; 
		НоваяСтрД.Категория = СтрД.Категория;
	КонецЦикла;
	
	Для каждого СтрД Из Категории Цикл
	    ДобавитьКолонкуДоп(СтрД.КлючСтроки, СтрД.Категория);
	КонецЦикла;   
	ЗаполнитьТаблицыИзПриказа();   
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицыИзПриказа() 		
		
	ТаблицаМеталловДоп = ТаблицаМеталлов.Выгрузить();
	ТаблицаМеталловДоп.Свернуть("Металл, Проба, СхемаКредитования, УстановитьЗначениеИлиОтконение, Отклонение");
	
	ТаблицаМ.Очистить();
	Для каждого Стр Из ТаблицаМеталловДоп Цикл 
		Если ПоГруппамПроб Тогда
			Проба = ЛБ_ОбщийМодуль.ПолучитьГруппуПроб(Стр.Проба);
		Иначе
			Проба = Стр.Проба;
		КонецЕсли; 
		Отбор = Новый Структура;
		Отбор.Вставить("Проба", Проба);
		Строки = ТаблицаМ.НайтиСтроки(Отбор);
		Если НЕ Строки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;	

		НоваяСтр = ТаблицаМ.Добавить();		 
		НоваяСтр.Металл = Стр.Металл; 
		НоваяСтр.Проба = Проба;   
		НоваяСтр.СхемаКредитования = Стр.СхемаКредитования;
		НоваяСтр.УстановитьЗначениеИлиОтконение = Стр.УстановитьЗначениеИлиОтконение;
		НоваяСтр.Отклонение = Стр.Отклонение;
				
		ОтборМ = Новый Структура;
		ОтборМ.Вставить("Металл", Стр.Металл);
		ОтборМ.Вставить("Проба", Стр.Проба);  
		ОтборМ.Вставить("СхемаКредитования", Стр.СхемаКредитования);
		ОтборМ.Вставить("УстановитьЗначениеИлиОтконение", Стр.УстановитьЗначениеИлиОтконение); 
		ОтборМ.Вставить("Отклонение", Стр.Отклонение);
		Для каждого СтрК Из Категории Цикл
			ОтборМ.Вставить("Категория", СтрК.Категория);
			СтрокиМ = ТаблицаМеталлов.НайтиСтроки(ОтборМ);
			Если НЕ СтрокиМ.Количество() = 0 Тогда 
				СтрМ = СтрокиМ.Получить(0); 
				Если Стр.УстановитьЗначениеИлиОтконение = Перечисления.ЛБ_УстановкаЗначенияИлиОтклонения.Значение Тогда
			        НоваяСтр["Категория_" + Строка(СтрК.КлючСтроки)] = СтрМ.Цена; 
				Иначе
					НоваяСтр["Категория_" + Строка(СтрК.КлючСтроки)] = СтрМ.ЗначениеОтклонения;
				КонецЕсли;	
			КонецЕсли;	
        Конеццикла;
	Конеццикла;	   
	
КонецПроцедуры   

&НаСервере
Процедура ДобавитьКолонкуДоп(КлючСтроки, Категория)
	МассивДобавляемыхРеквизитов = Новый Массив; 
	СписокТипов = Новый Массив;
    СписокТипов.Добавить(Тип("Число"));
    ОписаниеСоставногоТипа = Новый ОписаниеТипов(СписокТипов,,,Новый КвалификаторыЧисла(10,3));
	НовыйРеквизит = Новый РеквизитФормы("Категория_" + СокрЛП(КлючСтроки), ОписаниеСоставногоТипа, "ТаблицаМ");
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	 
	ПолеВвода = Элементы.Добавить(
		"Категория_" + СокрЛП(КлючСтроки),    //Имя элемента формы
		Тип("ПолеФормы"), //Тип, всегда ПолеФормы
		Элементы.ТаблицаМ); //Контейнер для поля ввода (Форма,Группа,Страница)
		
	ПолеВвода.Заголовок = СокрЛП(Категория);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	
	//Установка связи элемента с данными
	ПолеВвода.ПутьКДанным = "ТаблицаМ.Категория_" + СокрЛП(КлючСтроки); 
	ПолеВвода.ВыбиратьТип = Ложь;
	ПолеВвода.КнопкаСоздания = Ложь;
	ПолеВвода.КнопкаОткрытия = Ложь;  
	
КонецПроцедуры	

&НаКлиенте
Процедура СохранитьИзменения(Команда)
	СохранитьПриказ();
	ЭтаФорма.Закрыть(Истина);
КонецПроцедуры

&НаСервере
Процедура СохранитьПриказ()
	СохранитьИзмененияМеталловСФормы(ПоГруппамПроб);
	ДокументОбъект = Приказ.ПолучитьОбъект();
	ДокументОбъект.УсловияАкцииМеталлы.Загрузить(ТаблицаМеталлов.Выгрузить());
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура СохранитьИзмененияМеталловСФормы(ПоГруппам)
	Если ПоГруппам Тогда   
		Для каждого Стр Из ТаблицаМ Цикл 
			Для каждого СтрП Из Стр.Проба.Пробы Цикл 
				Отбор = Новый Структура;
				Отбор.Вставить("Металл", Стр.Металл);
				Отбор.Вставить("Проба", СтрП.Проба);
						
				СтрокиС = ТаблицаМеталлов.НайтиСтроки(Отбор);
				Для каждого СтрС Из СтрокиС Цикл 
					СтрС.УстановитьЗначениеИлиОтконение = Стр.УстановитьЗначениеИлиОтконение;
					СтрС.Отклонение = Стр.Отклонение;

					ОтборД = Новый Структура;  
					ОтборД.Вставить("Категория", СтрС.Категория);
					СтрокиД = Категории.НайтиСтроки(ОтборД); 
					Если НЕ СтрокиД.Количество() = 0 Тогда
						КлючСтроки = СтрокиД.Получить(0).КлючСтроки;    
						Если Стр.УстановитьЗначениеИлиОтконение = Перечисления.ЛБ_УстановкаЗначенияИлиОтклонения.Значение Тогда
						    СтрС.Цена = Стр["Категория_" + Строка(КлючСтроки)]; 
						Иначе
							СтрС.ЗначениеОтклонения = Стр["Категория_" + Строка(КлючСтроки)];
						КонецЕсли;	
					КонецЕсли;	
				Конеццикла;	
			Конеццикла;	
        конецЦикла;
	Иначе	
		Для каждого Стр Из ТаблицаМ Цикл  
			Отбор = Новый Структура;
			Отбор.Вставить("Металл", Стр.Металл);
			Отбор.Вставить("Проба", Стр.Проба);
					
			СтрокиС = ТаблицаМеталлов.НайтиСтроки(Отбор);
			Для каждого СтрС Из СтрокиС Цикл 
				СтрС.УстановитьЗначениеИлиОтконение = Стр.УстановитьЗначениеИлиОтконение;
				СтрС.Отклонение = Стр.Отклонение;

				ОтборД = Новый Структура;  
				ОтборД.Вставить("Категория", СтрС.Категория);
				СтрокиД = Категории.НайтиСтроки(ОтборД); 
				Если НЕ СтрокиД.Количество() = 0 Тогда
					КлючСтроки = СтрокиД.Получить(0).КлючСтроки;    
					Если Стр.УстановитьЗначениеИлиОтконение = Перечисления.ЛБ_УстановкаЗначенияИлиОтклонения.Значение Тогда
					    СтрС.Цена = Стр["Категория_" + Строка(КлючСтроки)]; 
					Иначе
						СтрС.ЗначениеОтклонения = Стр["Категория_" + Строка(КлючСтроки)];
					КонецЕсли;	
				КонецЕсли;	
			Конеццикла;	
		Конеццикла;	
	КонецЕсли;	
КонецПроцедуры	


&НаКлиенте
Процедура ТаблицаМПриАктивизацииСтроки(Элемент)
	ТекСтрока = Элементы.ТаблицаМ.ТекущиеДанные;
	ТекущаяУстановка = ТекСтрока.УстановитьЗначениеИлиОтконение;
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаМУстановитьЗначениеИлиОтконениеПриИзменении(Элемент)
	ТекСтрока = Элементы.ТаблицаМ.ТекущиеДанные;     
	Если НЕ ТекущаяУстановка = ТекСтрока.УстановитьЗначениеИлиОтконение Тогда
		ТекущаяУстановка = ТекСтрока.УстановитьЗначениеИлиОтконение;
	    Если ТекСтрока.УстановитьЗначениеИлиОтконение = ПредопределенноеЗначение("Перечисление.ЛБ_УстановкаЗначенияИлиОтклонения.Значение") Тогда
		    ТекСтрока.Отклонение = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.ПустаяСсылка");
		Иначе 
			ТекСтрока.Отклонение = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное");
		КонецЕсли;  
		Для каждого СтрК Из Категории Цикл
			КлючСтроки = СтрК.КлючСтроки; 
			ТекСтрока["Категория_" + Строка(КлючСтроки)] = 0;
		КонецЦикла;	  		
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ПоГруппамПробПриИзменении(Элемент)
	ПоГруппам = ?(ПоГруппамПроб, ложь, истина); 
	Элементы.ТаблицаМПроба.Заголовок = ?(ПоГруппамПроб, "Группа проб", "Проба");
	СохранитьИзмененияМеталловСФормы(ПоГруппам);
	ТаблицаМ.Очистить();
	ЗаполнитьТаблицыИзПриказа();
КонецПроцедуры
